// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Russian (`ru`).
class AppLocalizationsRu extends AppLocalizations {
  AppLocalizationsRu([String locale = 'ru']) : super(locale);

  @override
  String get appName => 'Umra';

  @override
  String get mainScreenNameString => 'UMRA';

  @override
  String get titleIhramScreen => 'Ихрам';

  @override
  String get titleRoundKaabaScreen => 'Обход Каабы';

  @override
  String get titlePlaceIbrohimStandScreen => 'Место стояния Ибрахима';

  @override
  String get titleWaterZamzamScreen => 'Питье воды Замзам';

  @override
  String get titleBlackStoneScreen => 'Возврат к Черному камню';

  @override
  String get titleSafaAndMarvaScreen => 'Сафа и Марва';

  @override
  String get titleShaveHeadScreen => 'Бритье головы';

  @override
  String get usefulTitle => 'Полезное';

  @override
  String get circleString => 'Прохождение:';

  @override
  String get addString => 'Добавить';

  @override
  String get resetString => 'Сбросить';

  @override
  String get sayFinishedString => 'Cа´й закончено';

  @override
  String get settingsString => 'Настройки';

  @override
  String get selectLanguageSettingsString => 'Выбрать язык';

  @override
  String get feedbackString => 'Обратная связь';

  @override
  String get rateTheAppString => 'Оценить приложение';

  @override
  String get appThemeString => 'Тема приложения';

  @override
  String get notificationSettingsString => 'Настройки уведомлений';

  @override
  String get selectLanguageString => 'Выбрать язык';

  @override
  String get themeHeavenly => 'Небо';

  @override
  String get themeOasis => 'Оазис';

  @override
  String get themeGold => 'Золото';

  @override
  String get themeTurquoise => 'Море';

  @override
  String get usefulInfoTitle => 'Полезная информация';

  @override
  String get step1EnterIhram => 'Вхождение в состояние ихрама';

  @override
  String get step1WhenEnteringIhram =>
      'При вхождении в состояниe ихрама произнесите:';

  @override
  String get step1FirstArabic => 'لَبَّيْكَ اللَّهُمَّ بِعُمْرَةَ';

  @override
  String get step1TurnToQiblah => 'Обратитесь лицом к кибле и скажите:';

  @override
  String get step1SecondArabic =>
      'اَللُّهُمَّ هَذِهِ عُمْرَةً لاٰ رِيَاءَ فِيهَا وَلَا سُمْعَةَ';

  @override
  String get step1OAllahUmrah =>
      'О Аллах, эта Умра — нет в ней показухи и стремления к славе!';

  @override
  String get step1ThirdArabic =>
      'لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ،\nإِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ';

  @override
  String get step1Labbayka => 'Ляббайка Аллоhумма ляббайка';

  @override
  String get step1EnteringSacredMosque =>
      'Войдя в Заповедную мечеть с правой ноги';

  @override
  String get step1EnteringSacredMosqueDuaArabic =>
      'اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ سَلِّمْ،اَللَّهُمَّ افْتَحْ لِي اَبْوَابَ رَحْمَتِكَ';

  @override
  String get step1EnteringSacredMosqueDua => 'Вход в Заповедную мечеть';

  @override
  String get step1ConditioningHajjArabic =>
      'اَللَّهُمَّ مَحِلِّي حَيْثُ حَبَسْتَنِي';

  @override
  String get step1ConditioningHajj => 'Обусловливание Хаджа или Умры.';

  @override
  String get step1ConditioningHajjText =>
      'Если паломник опасается, что какая-либо причина может помешать ему совершить хадж до конца – будь то болезнь или страх, то до произнесении тальбии он может обусловить свой хадж пред Всевышним Господом, сказав то, чему научил посланник, да пребудет над Ним мир и благословение Аллаха:';

  @override
  String get step1IhramText1 =>
      '«Аллоhумма махьилли хьайсу хьабастани»\n\n«О Аллах, мое место вхождения в ихрам там, где Ты меня задержал».\n\nЭтот хадис является согласованным. См. также «Сахих Аби Дауд» (1776).\n\nПоэтому, если паломник поступит так, и его что-то задержит или он заболеет, то ему разрешено выйти из состояния ихрама при совершении хаджа или умры, и ему не надо будет приносить в жертву животное в качестве искупления и снова повторять хадж, если только это не был его первый хадж, являющийся обязательным, который в таком случае следует совершить заново.';

  @override
  String get step1UmrahForParents => 'Умра за родителей';

  @override
  String get step1UmrahForFatherArabic =>
      'لَبَّيْكَ ٱللّٰهُمَّ بِعُمْرَةٍ عَنْ أَبِي';

  @override
  String get step1UmrahForFather =>
      'Ляббайка Аллаhумма би-\'умраh \'ан аби (имя отца) - «О Аллах, я совершаю \'умру за моего отца (имя).»';

  @override
  String get step1UmrahForMotherArabic =>
      'لَبَّيْكَ ٱللّٰهُمَّ بِعُمْرَةٍ عَنْ أُمِّي';

  @override
  String get step1UmrahForMother =>
      'Ляббайка Аллаhумма би-\'умраh \'ан умми (имя матери) - «О Аллах, я совершаю \'умру за мою мать (имя).»';

  @override
  String get step1UmrahForOtherArabic => 'لَبَّيْكَ ٱللّٰهُمَّ بِعُمْرَةٍ عَنْ';

  @override
  String get step1UmrahForOther =>
      'Ляббайка Аллаhумма би-\'умраh \'ан (имя человека) - «О Аллах, я совершаю \'умру за (имя человека).»';

  @override
  String get step1UmrahForFatherTitle => 'Умра за отца:';

  @override
  String get step1UmrahForMotherTitle => 'Умра за мать:';

  @override
  String get step1UmrahForOtherTitle => 'Умра за другого человека:';

  @override
  String get step1UmrahForParentsExplanation =>
      'Если вы хотите совершить умру за своих родителей или другого человека, вместо обычной тальбии произнесите одну из приведённых формул, добавив после слов «аби» (отца), «умми» (матери) или просто после слова «\'ан» имя того, за кого совершается умра. После произнесения намерения и тальбии с упоминанием имени, все остальные действия, мольбы (дуа) и поминания Аллаха (зикры) совершаются как обычно, будто вы делаете умру для себя. Единственное различие — это намерение.';

  @override
  String get step2KaabaText1 => 'Обход Каабы';

  @override
  String get step2KaabaText2 =>
      'Начните семикратный обход Каабы (таваф).\n\nС самого начала этого обхода Каабы и до его завершения мужчины обнажают правое плечо.\n\nПосле этого паломник прикасается к Черному камню своей рукой и целует его.\n\nЕсли нет возможности поцеловать Черный камень, следует прикоснуться к Черному камню своей рукой.\n\nЕсли нет возможности прикоснуться и поцеловать Черный камень, то обратитесь к нему лицом, укажите на него правой рукой и произнесите такбир: «Аллаhу акбар» Аллах Велик. (Все это следует делать во время каждого круга при обходе Ка\'бы.)';

  @override
  String get step2KaabaText3 =>
      'Начните семикратный обход Каабы (таваф) от Чёрного камня.\n\nПрохождение от Чёрного камня до Чёрного камня считается за один круг. Начиная новый круг, укажите правой рукой на Чёрный камень и произнесите такбир. Первые три круга, от Чёрного камня до Чёрного камня, мужчинам необходимо пройти быстрым шагом, а оставшиеся четыре — обычным шагом. При возможности прикасайтесь к йеменскому углу во время каждого круга. Всякий раз, проходя между йеменским углом и Чёрным камнем, следует сказать:';

  @override
  String get step2KaabaText4 =>
      'Роббана, атина фи-д-дунья хьасанатан ва филь-ахироти хьасанатан ва къына \'азаба-н-нар\n\n«Господь наш! Одари нас добром в этом мире и добром в Последней жизни и защити нас от мучений в Огне!»,\n\nсура \"Корова\", аят 201.';

  @override
  String get step2DuaArabic =>
      'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ';

  @override
  String get step2TakbirArabic => 'الله أكبر';

  @override
  String get step3PrayerAfterTawaf => 'Намаз после обхода Каабы.';

  @override
  String get step3CompletedSevenCircuits =>
      'Завершив семикратный обход Каабы, мужчина прикрывает правое плечо. Затем направьтесь к месту стояния Ибрахима и произнесите:';

  @override
  String get step3ArabicText =>
      'وَاتَّخِذُوا مِن مَّقَامِ إِبْرَاهِيمَ مُصَلًّ';

  @override
  String get step3PlaceOfStanding =>
      'Ва-ттахизу мим-макъоми Иброhима мусолля\n\n«Изберите же место [стояния] Ибрахима местом моления» (сура 2 «Аль-Бакара = Корова», аят 125).\n\nПри возможности за местом стояния Ибрахима либо же в любом месте Заповедной мечети совершите два рак\'ата намаза. Не забудьте установить перед собой преграду так, чтобы между вами и этой преградой никто не проходил. В первом рак\'ате после суры 1 «Аль-Фатиха = Открывающая» прочтите суру 109 «АльКяфирун = Неверующие», а во втором рак\'ате после суры «АльФатиха» прочтите суру 112 «Аль-Ихляс = Очищение веры».\n\nЗавершив намаз, отправьтесь к источнику с водой Замзам.';

  @override
  String get step4DrinkingZamzam => 'Питье воды Замзам.';

  @override
  String get step4ZamzamText =>
      'Выпейте воду и полейте её себе на голову.\n\nДжабир (да будет доволен им Аллах) рассказывал: \"Пророк (мир ему и благословение Аллаха) направился к колодцу Замзам, выпил из него воды и полил её себе на голову\". Ахмад (3/394), Ибн Хузайма (4/305). Достоверность хадиса подтвердили аз-Заркаши, Бадруддин аль-\'Айни, Шу\'айб аль-Арнаут. См. «\'Умдатуль-къари» (9/227), «Хашия \'аля аль-Манасик» (стр. 263), «Тахридж аль-Муснад» (15243).\n\nСо слов Джабира (да будет доволен им Аллах) сообщается, что Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Вода Замзам способствует осуществлению того, для чего её пьют».\n\nАхмад (3/357), Ибн Маджах (3062), аль-Хаким (1739). Достоверность хадиса подтвердили Суфьян ибн \'Уяйна, аль-Мунзири, ад-Думьяты, Ибн аль-Къайим, аз-Заркаши, Ибн Хаджар, аль-Альбани. См. \"аль-Муджаляса\" (509), \"аль-Матджар ар-рабих\" (982), \"Задуль-ма\'ад\" (4/393), \"аль-Макъасыд аль-хасана\" (928), \"Файдуль-Къадир\" (7759), \"Сахих ат-Таргъиб\" (1165).\n\nСказал аш-Шаукани: \"В данном хадисе содержится доказательство на то, что питьё воды Замзам приносит пользу пьющему, с каким бы намерением он ни пил её, будь это дела мира этого или мира Вечного. Ведь слова: «Способствует осуществлению того, ради чего её пьют» являются обобщёнными\". См. \"Нейлюль-аутар\" (5/105).\n\nСказал ан-Науауи: \"Смысл этого хадиса в том, что пьющий эту воду для чего-то конкретного, приобретает это. Воистину, испробовали это учёные и праведники для достижения своих нужд, связанных с миром этим и миром Вечным и получили это по милости Всевышнего Аллаха\". См. \"Тахзиб аль-асма уа-ллюгъат\" (3/139).';

  @override
  String get step5ReturnToBlackStone => 'Возврат к Черному камню.';

  @override
  String get step5ReturnReciteTakbir =>
      'Возвратитесь к Чёрному камню, произносите такбир и прикаснитесь к нему так же, как было разъяснено ранее. Или укажите на него рукой и произнесите такбир. Аллах Велик.';

  @override
  String get step5AllahIsGreat => 'Аллаhу Акбар.';

  @override
  String get step5TakbirArabic => 'الله أكبر';

  @override
  String get step6SafaAndMarwa => 'Сафа и Марва';

  @override
  String get step6HeadTowardsSafa =>
      'Направьтесь к холму Сафа для совершения семикратного ритуального прохождения между холмами Сафа и Марва (са\'й). Начните са\'й у холма Сафа.\n\nПриблизившись к Сафе, прочтите:';

  @override
  String get step6SurahBaqarahArabic =>
      'إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ اللهِ ۖ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَنْ يَطَّوَّفَ بِهِمَا ۚ وَمَنْ تَطَوَّعَ خَيْرًا فَإِنَّ اللهَ شَاكِرٌ عَلِيمٌ';

  @override
  String get step6SurahBaqarahVerse => 'Сура Аль-Бакара, аят 158.';

  @override
  String get step6SurahBaqarahText =>
      'Инна-с-Софа валь-Марвата мин ша\'аири-ЛлЯh, фаман хьаджжа-ль-байта ави\'-тамаро фаля джунахьа \'аляйhи айй-йат\'т\'оввафа биhима, ва ман тат\'ова\'а хойран фа-инна-ЛЛоhа Шакирун \'алим.\n\n«Воистину, ас-Сафа и аль-Марва – одни из обрядовых знамений Аллаhа. Кто совершает хадж к Ка\'бе или \'умру, тот не совершит греха, если пройдет между ними. А если кто добровольно совершает доброе дело, то ведь Аллаh – Признательный, Знающий.» (сура «Корова», аят 158)\n\nЗатем скажите:';

  @override
  String get step6WeBeginArabic => 'نَبْدَأُ بِمَا بَدَأَ اللهُ بِهِ';

  @override
  String get step6WeBegin => 'Мы начинаем с того, с чего начал Аллах';

  @override
  String get step6WeBeginText =>
      'Набдау бима бадаа-Ллоhу биhи\n\n«Мы начинаем с того, с чего начал Аллах»\n\nПоднимитесь на холм Сафа, повернитесь лицом к Каабе и произнесите:';

  @override
  String get step6RemembranceArabic =>
      'اَلله أَكْبَرُ الله أَكْبَرُ الله اَكْبَرُ، لٰا إِلَهَ إِلَّا اللهُ وَحْدَهُ لٰا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ، يُحْيِي وَ يُمِيتُ ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ.';

  @override
  String get step6RemembranceTitle =>
      'Поминание Аллаха во время Са\'и между Сафа и Марва.';

  @override
  String get step6RemembranceText =>
      'Аллаhу акбар! Аллаhу акбар! Аллаhу акбар!\n\nЛя иляhа илля-ЛлАhу вахьдаhу ля шарика ляhу! Ляhуль мульку ва ляhуль хьамду йухьйи ва йумиту ва hува \'аля кулли шайъин къодиир! Ля иляhа илля Ллohу вахьдаhу ля шарика ляhу анджаза ва\'даh, ва насо-ро \'абдаh, ва hазамаль ахьзаба вахьдаh.\n\n«Аллах Превелик, Аллах Превелик, Аллах Превелик!\n\nНет божества, кроме Аллаhа, Одного, у Которого нет сотоварища! Ему принадлежит власть и надлежит хвала, Он оживляет и умерщвляет, и Он властен над всем сущим! Нет божества, кроме одного Аллаhа, у Которого нет сотоварища! Он выполнил Свое обещание, помог Своему рабу и в одиночку разбил враждебные племена»\n\nПроизнесите эти слова три раза, поднимая руки для дуа после первого и второго раза. Затем начните прохождение от холма Сафа к Марве. Одно прохождение от Сафы до Марвы считается одним разом, а обратный путь — уже вторым. На холме Марва повторите тот же порядок: зикр — дуа — зикр — дуа — зикр. Эти зикры и дуа следует повторять на каждом подъёме на Сафа и Марву, кроме седьмого прохождения. Дойдя до первой отметки, обозначенной зелёным цветом, мужчинам необходимо пробежать до второй отметки. Остальной путь совершается обычным шагом.\n\nВо время обряда са\'й можно обратиться к Аллаху с такой мольбой:';

  @override
  String get step6DuasDuringSaiArabic =>
      'رَبِّ اغْفِرْ وَ ارْحَمْ، إِنَّكَ أَنْتَ الْأَعَزُّ الْاَكْرَمُ.';

  @override
  String get step6DuasDuringSaiTitle =>
      'Дуа во время обряда Са\'и между Сафа и Марва.';

  @override
  String get step6DuasDuringSaiText =>
      'Рабби-г1фир ва-рхьам, иннакя анталь а\'аззу-ль-акрам\n\n«Господи, прости и помилуй, ибо Ты – Самый Великий и Великодушный!»,\n\nв этом нет ничего плохого, поскольку эта мольба установлена от целой группы праведных предшественников.\n\nПо завершении седьмого обхода, паломник больше не произносит зикр и дуа на холме Марва. Это означает, что обряд Са\'й завершён.\n\nМольба при выходе из Заповедной мечети. Завершив седьмое прохождение на холме Марва, выйдите из Заповедной мечети с левой ноги, сказав:';

  @override
  String get step6ExitingSacredMosqueArabic =>
      'اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَ سَلِّمْ ، اَللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ.';

  @override
  String get step6ExitingSacredMosqueTitle =>
      'Дуа при выходе из Заповедной мечети.';

  @override
  String get step6ExitingSacredMosqueText =>
      'Аллаhумма, солли 1аля Мухьаммадин ва саллим! Аллаhумма, инни ас\'алю-ка мин фадли-ка!\n\nО Аллах, благослови Мухаммада и ниспошли ему мир! О Аллах, воистину, я прошу Тебя о Милости Твоей!';

  @override
  String get step6RemembranceDuringSai =>
      'Аллаhу акбар! Аллаhу акбар! Аллаhу акбар!\n\nЛя иляhа илля-ЛлАhу вахьдаhу ля шарика ляhу! Ляhуль мульку ва ляhуль хьамду йухьйи ва йумиту ва hува \'аля кулли шайъин къодиир! Ля иляhа илля Ллohу вахьдаhу ля шарика ляhу анджаза ва\'даh, ва насо-ро \'абдаh, ва hазамаль ахьзаба вахьдаh.\n\n«Аллах Превелик, Аллах Превелик, Аллах Превелик!\n\nНет божества, кроме Аллаhа, Одного, у Которого нет сотоварища! Ему принадлежит власть и надлежит хвала, Он оживляет и умерщвляет, и Он властен над всем сущим! Нет божества, кроме одного Аллаhа, у Которого нет сотоварища! Он выполнил Свое обещание, помог Своему рабу и в одиночку разбил враждебные племена»\n\nПроизнесите эти слова три раза, поднимая руки для дуа после первого и второго раза. Затем начните прохождение от холма Сафа к Марве. Одно прохождение от Сафы до Марвы считается одним разом, а обратный путь — уже вторым. На холме Марва повторите тот же порядок: зикр — дуа — зикр — дуа — зикр. Эти зикры и дуа следует повторять на каждом подъёме на Сафа и Марву, кроме седьмого прохождения. Дойдя до первой отметки, обозначенной зелёным цветом, мужчинам необходимо пробежать до второй отметки. Остальной путь совершается обычным шагом.\n\nВо время обряда са\'й можно обратиться к Аллаху с такой мольбой:';

  @override
  String get step6DuasDuringSai =>
      'Рабби-г1фир ва-рхьам, иннакя анталь а\'аззу-ль-акрам\n\n«Господи, прости и помилуй, ибо Ты – Самый Великий и Великодушный!»,\n\nв этом нет ничего плохого, поскольку эта мольба установлена от целой группы праведных предшественников.\n\nПо завершении седьмого обхода, паломник больше не произносит зикр и дуа на холме Марва. Это означает, что обряд Са\'й завершён.\n\nМольба при выходе из Заповедной мечети. Завершив седьмое прохождение на холме Марва, выйдите из Заповедной мечети с левой ноги, сказав:';

  @override
  String get step6ExitingSacredMosque =>
      'Аллаhумма, солли 1аля Мухьаммадин ва саллим! Аллаhумма, инни ас\'алю-ка мин фадли-ка!\n\nО Аллах, благослови Мухаммада и ниспошли ему мир! О Аллах, воистину, я прошу Тебя о Милости Твоей!';

  @override
  String get step7ShavingHead => 'Бритьё головы либо укорачивание волос.';

  @override
  String get step7MenShortenHair =>
      'Затем мужчина равномерно укорачивает волосы на своей голове либо сбривает её, а женщина состригает локон величиной с треть пальца.\n\nПримечание:\n\nПриехавшим в хадж лучше укоротить волосы, если они не успеют отрасти после \'умры до хаджа, так как бритьё головы совершается во время хаджа.\n\nПриехавшим совершить только \'умру (без хаджа) лучше обрить голову.\n\nПолный выход из состояния ихрама.\n\nНа этом \'умра заканчивается. Мужчина снимает одеяние ихрам. Ограничения, действовавшие в состоянии ихрама, сняты.';

  @override
  String get step7DuaAtEnd =>
      'В заключение я прошу Всевышнего Аллаха принять все наши благие дела и сохранить нам награду за их совершение вплоть до того Дня, когда мы с Ним встретимся,\n\n«в тот День, когда ни богатство, ни сыновья не принесут пользы никому, кроме тех, которые предстанут перед Аллахом с непорочным сердцем»\n\n(Сура «Поэты», аяты 88–89).\n\nЯ также прошу Всевышнего Аллаха даровать полную награду всем, кто участвовал в создании, развитии и распространении этого приложения — будь то советом, знаниями, средствами или добрым словом — за каждую Умру, совершённую с его помощью.\n\nКак сказал Посланник Аллаха (мир ему и благословение Аллаха):\n\n«Кто указывает на благое, тот получит такую же награду, как и тот, кто совершает это благое дело»\n\n(Сахих Муслим, № 1893).\n\nХвала Аллаху, Господу миров!';
}
